home/features/emacs/doom/config.org
** Yas Snippets
Use yas snippets templating package
#+begin_src emacs-lisp
(use-package yasnippet
  :config

  (yas-global-mode 1))
#+end_src

** COMMENT dired-preview
https://protesilaos.com/emacs/dired-preview
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! dired-preview)
#+end_src

#+begin_src  emacs-lisp :results none
(require 'dired-preview)
(add-hook 'dired-mode-hook #'dired-preview-mode)
#+end_src

** COMMENT dired dragon-drop
#+begin_src  emacs-lisp :results none
(map! :map dired-mode-map
      :leader :desc "Opens file in dragon-drop" :gnv "l" (start-process "" nil "dragon-drop" (lambda (fPath) (let ((process-connection-type nil)) (start-process "" nil "dragon-drop" fPath)) ) (dired-get-marked-files) ))
#+end_src

** direnv integration
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! direnv)
#+end_src
** zoxide integration
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! zoxide)
#+end_src
* org
** LaTeX Exporter
#+begin_src  emacs-lisp :results none
(after! org
  (use-package! ox-extra
    :config
    (ox-extras-activate '(latex-header-blocks ignore-headlines))))

(after! org
  ;; Import ox-latex to get org-latex-classes and other funcitonality
  ;; for exporting to LaTeX from org
  (use-package! ox-latex
    :init
    ;; code here will run immediately
    :config
    ;; code here will run after the package is loaded
    (setq org-latex-pdf-process
          '("pdflatex -interaction nonstopmode -output-directory %o %f"
            "bibtex %b"
            "pdflatex -interaction nonstopmode -output-directory %o %f"
            "pdflatex -interaction nonstopmode -output-directory %o %f"))
    (setq org-latex-with-hyperref nil) ;; stop org adding hypersetup{author..} to latex export
    ;; (setq org-latex-prefer-user-labels t)

    ;; deleted unwanted file extensions after latexMK
    (setq org-latex-logfiles-extensions
          (quote ("lof" "lot" "tex~" "aux" "idx" "log" "out" "toc" "nav" "snm" "vrb" "dvi" "fdb_latexmk" "blg" "brf" "fls" "entoc" "ps" "spl" "bbl" "xmpi" "run.xml" "bcf" "acn" "acr" "alg" "glg" "gls" "ist")))

    (unless (boundp 'org-latex-classes)
      (setq org-latex-classes nil))))
#+end_src

** Style
Symbol at the end of a folded block.
By default its =blockname...=
This changes it so it's =blockname ▾=
#+begin_src  emacs-lisp :results none
(after! org
  (setq org-startup-folded 'overview
        org-ellipsis " ▾ "
        org-list-demote-modifier-bullet '(("+" . "-") ("-" . "+"))))
#+end_src

** Pretty Mode
org-pretty-mode hides ** // == characters when not hovering over works they surround.

Automatically starts org-pretty-mode alongside org-mode
#+begin_src  emacs-lisp :results none
(add-hook! 'org-mode-hook
           #'+org-pretty-mode)
#+end_src

** Heading Size
Use different font sizes for headlines and define sections for a fixed-pitch font.
#+begin_src  emacs-lisp :results none
(after! org
  (custom-set-faces!
    '(org-document-title :height 1.3)
    '(org-level-1 :inherit outline-1 :weight extra-bold :height 1.2)
    '(org-level-2 :inherit outline-2 :weight bold :height 1.15)
    '(org-level-3 :inherit outline-3 :weight bold :height 1.12)
    '(org-level-4 :inherit outline-4 :weight bold :height 1.09)
    '(org-level-5 :inherit outline-5 :weight semi-bold :height 1.06)
    '(org-level-6 :inherit outline-6 :weight semi-bold :height 1.03)
    '(org-level-7 :inherit outline-7 :weight semi-bold)
    '(org-level-8 :inherit outline-8 :weight semi-bold)
    ;; Ensure that anything that should be fixed-pitch in org buffers appears that way
    '(org-block nil :foreground nil :inherit 'fixed-pitch)
    '(org-code nil   :inherit '(shadow fixed-pitch))
    '(org-table nil   :inherit '(shadow fixed-pitch))
    '(org-verbatim nil :inherit '(shadow fixed-pitch))
    '(org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    '(org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    '(org-checkbox nil :inherit 'fixed-pitch)))
#+end_src

** TODO Setting directory variables
If you use `org' and don't want your org files in the default location below,
change `org-directory'. It must be set before org loads!
#+begin_src  emacs-lisp :results none
(setq org-directory "/home/keith/workspace/org")
(after! org
    ;; (setq org-agenda-files '("~/workspace/org/roam/*.org"))
    ;; (setq org-agenda-files (directory-files-recursively org-directory ".org$"))
    ;; (setq org-agenda-files (list "/home/keith/workspace/org/roam"))
    (setq org-log-done 'time)
)
(set-file-template! "/roam/.+\\.org$" 'org-mode :ignore t)
;; https://github.com/bradydonald/.emacs.d
;; (defun my/org-agenda-files ()
;;   ;; org files for agenda
;;   (setq ofiles (directory-files-recursively org-directory "org$"))
;;   ;; some may be encrypted though
;;   (setq gfiles (directory-files-recursively org-directory "org.gpg$"))
;;   (append ofiles gfiles))

;; (setq org-agenda-files (my/org-agenda-files))
#+end_src

** org-agenda
*** org-super-agenda
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! org-super-agenda)
#+end_src

#+begin_src  emacs-lisp :results none
(use-package! org-super-agenda
  :after org-agenda
  :init
  (setq org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t
      org-agenda-include-deadlines t
      org-agenda-block-separator nil
      org-agenda-compact-blocks t
      org-agenda-start-day nil ;; i.e. today
      org-agenda-span 7
      org-agenda-start-on-weekday nil)
  (setq org-agenda-custom-commands
        '(("c" "Super view"
           ((agenda "" ((org-agenda-overriding-header "")
                        (org-super-agenda-groups
                         '((:name "Today"
                                  :time-grid t
                                  :date today
                                  :order 1)))))
            (alltodo "" ((org-agenda-overriding-header "")
                         (org-super-agenda-groups
                          '((:log t)
                            (:name "To refile"
                                   :file-path "refile\\.org")
                            (:name "Next to do"
                                   :tag "NEXT"
                                   :order 1)
                            (:name "Important"
                                   :priority "A"
                                   :order 6)
                            (:name "Today's tasks"
                                   :file-path "journal/")
                            (:name "Due Today"
                                   :deadline today
                                   :order 2)
                            (:name "Scheduled Soon"
                                   :scheduled future
                                   :order 8)
                            (:name "Overdue"
                                   :deadline past
                                   :order 7)
                            (:name "Meetings"
                                   :and (:todo "MEET" :scheduled future)
                                   :order 10)
                            (:discard (:not (:todo "TODO")))))))))))
  :config
  (org-super-agenda-mode))
#+end_src

*** org-timeblock
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! org-timeblock)
#+end_src

#+begin_src  emacs-lisp :results none
#+end_src

** org-roam
Org-roam-ui tries to keep up with the latest features of org-roam, which conflicts with Doom Emacs's desire for stability.
To make sure nothing breaks, use the latest version of org-roam by unpinning it.
#+begin_src  emacs-lisp :results none :tangle packages.el
(unpin! org-roam)
(package! org-roam-ui)
#+end_src

#+begin_src  emacs-lisp :results none
(use-package org-roam
  :ensure t
  :demand t  ;; Ensure org-roam is loaded by default
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/workspace/org/roam")
  (org-roam-completion-everywhere t)
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i" . completion-at-point)
         :map org-roam-dailies-map
         ("Y" . org-roam-dailies-capture-yesterday)
         ("T" . org-roam-dailies-capture-tomorrow))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  :config
  (require 'org-roam-dailies) ;; Ensure the keymap is available
  (org-roam-db-autosync-mode))
#+end_src

The buffer you put this code in must have lexical-binding set to t!
See the final configuration at the end for more details.

