home/features/emacs/doom/config.org
*** org-roam-ui
Here's a very basic sample configuration of =org-roam= using =use-package=:
Obtained from the [[https://github.com/org-roam/org-roam][org-roam]] github.
#+begin_src  emacs-lisp :results none
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
    ;; :hook (after-init . org-roam-ui-mode)
    :custom
    (org-roam-directory "~/workspace/org/roam/")
    (org-roam-dailies-capture-templates
      '(("d" "default" entry "* %<%I:%M %p>: %?"
         :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

#+end_src

** org-ref
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! org-ref)
#+end_src

** org-pomodoro
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! pomodoro)
(package! org-pomodoro)
#+end_src

#+begin_src  emacs-lisp :results none
(after! org
  (setq org-clock-sound "~/.doom.d/ding.mp3"))
#+end_src

** org-appear
Use [[https://github.com/awth13/org-appear][org-appear]] to reveal emphasis markers when moving the cursor over them.
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! org-appear
  :recipe (:host github
           :repo "awth13/org-appear"))
#+end_src

#+begin_src  emacs-lisp :results none
(add-hook! org-mode :append #'org-appear-mode)
#+end_src

** org-Publish
#+begin_src  emacs-lisp :results none
(setq org-publish-use-timestamps-flag nil)
(setq org-export-with-broken-links t)
(setq org-publish-project-alist
      '(("keithbutler.xyz"
         :base-drectory "~/workspace/org/keithbutler.xyz/"
         :base-extension "org"
         :publishing-directory "~/workspace/org/keithbutler.xyz/html/"
         :recursive t
         :exclude "org-html-themes/.*"
         :publishing-function org-html-publish-to-html
         :headline-levels 4
         :auto-preamble t)))
#+end_src

** org-auto-tangle
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! org-auto-tangle)
#+end_src

#+begin_src  emacs-lisp :results none
(use-package org-auto-tangle
  :load-path "site-lisp/org-auto-tangle/"    ;; this line is necessary only if you cloned the repo in your site-lisp directory
  :defer t
  :hook (org-mode . org-auto-tangle-mode))
#+end_src

** openwith
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! openwith)
#+end_src

#+begin_src  emacs-lisp :results none
(when (require 'openwith nil 'noerror)
    (setq openwith-associations
        (list
            (list (openwith-make-extension-regexp
                '("mpg" "mpeg" "mp3" "mp4"
                    "avi" "wmv" "wav" "mov" "flv"
                    "ogm" "ogg" "mkv"))
                "mpv"
                '(file))
            (list (openwith-make-extension-regexp
                '("xbm" "pbm" "pgm" "ppm" "pnm"
                    "png" "gif" "bmp" "tif" "jpeg" "jpg"))
                "feh"
                '(file))
            (list (openwith-make-extension-regexp
                '("doc" "xls" "ppt" "odt" "ods" "odg" "odp"))
                "libreoffice"
                '(file))
            '("\\.lyx" "lyx" (file))
            '("\\.chm" "kchmviewer" (file))
            (list (openwith-make-extension-regexp
                '("ps" "ps.gz" "dvi"))
                "okular"
                '(file))
            (list (openwith-make-extension-regexp
                '("xcf" "ai" "psd" "svg" "tu    b"))
                "gimp"
                '(file))
            (list (openwith-make-extension-regexp
                '("kdenlive"))
                "kdenlive"
                '(file))
            ))
    (openwith-mode 1))
#+end_src

* Languanges
** Org-babel-do-load-languages
#+begin_src emacs-lisp
;; active Babel languages
(org-babel-do-load-languages
 'org-babel-load-languages
 '((mermaid . t)
   (scheme . t)
   (emacs-lisp . t)
   (python . t)
   (Kotlin . t)
   (bash . t)
   (sql . t)
   (rust . t)
   (plantuml. t)
   ))
#+end_src

** Programming
*** Mongodb
I'm currently using mongodb in college.
So these packages help alot when righting reports.
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! mongo)
(package! ob-mongo)
#+end_src

*** Kotlin
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! ob-kotlin)
#+end_src

** Design
*** ob-mermaid
[[https://github.com/arnm/ob-mermaid][GitHub - arnm/ob-mermaid: Generate mermaid diagrams within Emacs org-mode babel]]
#+begin_src  emacs-lisp :results none :tangle packages.el
(package! ob-mermaid)
#+end_src

*** Plantuml
#+begin_src emacs-lisp
(add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
(org-babel-do-load-languages 'org-babel-load-languages '((plantuml . t)))
#+end_src

* Applications
** COMMENT Mail
#+begin_src  emacs-lisp :results none :tangle packages.el
(unpin! mu4e)
#+end_src

#+begin_src  emacs-lisp :results none
(use-package! mu4e
  ;; :defer 20 ; Wait until 20 seconds after startup
  :config

  ;; Load org-mode integration
  ;; (require 'org-mu4e)

  ;; Refresh mail using isync every 10 minutes
  (setq mu4e-update-interval (* 10 60))
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-root-maildir "~/.local/share/mail")

  ;; Use Ivy for mu4e completions (maildir folders, etc)
  (setq mu4e-completing-read-function #'ivy-completing-read)

  ;; Make sure that moving a message (like to Trash) causes the
  ;; message to get a new file name.  This helps to avoid the
  ;; dreaded "UID is N beyond highest assigned" error.
  ;; See this link for more info: https://stackoverflow.com/a/43461973
  (setq mu4e-change-filenames-when-moving t)

  (set-email-account! "Personal"
  '((mu4e-sent-folder       . "/keithbutler2001-gmail/[Gmail]/Sent Mail")
    (mu4e-drafts-folder     . "/keithbutler2001-gmail/[Gmail]/Drafts")
    (mu4e-trash-folder      . "/keithbutler2001-gmail/[Gmail]/Bin")
    (mu4e-refile-folder     . "/keithbutler2001-gmail/[Gmail]/All Mail")
    (smtpmail-smtp-user     . "smtp.gmail.com")
    (user-mail-address      . "keithbutler2001@gmail.com")    ;; only needed for mu < 1.4
    (mu4e-compose-signature . "Regards\nKeith Butler"))
  t)
  (set-email-account! "College"
  '((mu4e-sent-folder       . "/20089137@mail.wit.ie/[Gmail]/Sent Mail")
    (mu4e-drafts-folder     . "/20089137@mail.wit.ie/[Gmail]/Drafts")
    (mu4e-trash-folder      . "/20089137@mail.wit.ie/[Gmail]/Bin")
    (mu4e-refile-folder     . "/20089137@mail.wit.ie/[Gmail]/All Mail")
    (smtpmail-smtp-user     . "smtp.gmail.com")
    (user-mail-address      . "20089137@mail.wit.ie")    ;; only needed for mu < 1.4
    (mu4e-compose-signature . "Regards\nKeith Butler"))
  t)
  ;; (set-email-account! "Work"
  ;; '((mu4e-sent-folder       . "/keith@keithbutler.xyz/Sent")
  ;;   (mu4e-drafts-folder     . "/keith@keithbutler.xyz/Drafts")
  ;;   (mu4e-trash-folder      . "/keith@keithbutler.xyz/Trash")
  ;;   (mu4e-refile-folder     . "/keith@keithbutler.xyz/Archive")
  ;;   (smtpmail-smtp-user     . "smtp.gmail.com")
  ;;   (user-mail-address      . "keith@keithbutler.xyz"))    ;; only needed for mu < 1.4
  ;; t)

(setq mu4e-context-policy 'ask-if-none
      mu4e-compose-context-policy 'always-ask)

  ;; Prevent mu4e from permanently deleting trashed items
  ;; This snippet was taken from the following article:
  ;; http://cachestocaches.com/2017/3/complete-guide-email-emacs-using-mu-and-/
  (defun remove-nth-element (nth list)
    (if (zerop nth) (cdr list)
      (let ((last (nthcdr (1- nth) list)))
        (setcdr last (cddr last))
        list)))
  (setq mu4e-marks (remove-nth-element 5 mu4e-marks))
  (add-to-list 'mu4e-marks
               '(trash
                 :char ("d" . "▼")
                 :prompt "dtrash"
                 :dyn-target (lambda (target msg) (mu4e-get-trash-folder msg))
                 :action (lambda (docid msg target)
                           (mu4e-proc-move docid
                                           (mu4e-mark-check-target target) "-N"))))

  ;; Display options
  ;; (setq mu4e-view-show-images t)
  ;; (setq mu4e-view-show-addresses 't)

  ;; Composing mail
  (setq mu4e-compose-dont-reply-to-self t)

  ;; Use mu4e for sending e-mail
  (setq mail-user-agent 'mu4e-user-agent
        message-send-mail-function 'smtpmail-send-it
        mu4e-compose-signature '"\nRegards\nKeith"
        mu4e-compose-context-policy 'ask-if-none
        smtpmail-smtp-service 465
        smtpmail-stream-type 'ssl)

  ;; Signing messages (use mml-secure-sign-pgpmime)
  ;; (setq mml-secure-openpgp-signers '("53C41E6E41AAFE55335ACA5E446A2ED4D940BF14"))
  (setq mml-secure-openpgp-signers '("BFDA9493A1B0BCAE1FDDD95434E6FE022005CFAB"))
  (add-hook 'message-send-hook 'mml-secure-message-sign-pgpmime)


  ;; (See the documentation for `mu4e-sent-messages-behavior' if you have
  ;; additional non-Gmail addresses and want assign them different
  ;; behavior.)

  ;; setup some handy shortcuts
  ;; you can quickly switch to your Inbox -- press ``ji''
  ;; then, when you want archive some messages, move them to
  ;; the 'All Mail' folder by pressing ``ma''.
  (setq mu4e-maildir-shortcuts
        '((:maildir "/keithbutler2001@gmail.com/[Gmail]/INBOX"       . ?i)
          (:maildir "/keithbutler2001@gmail.com/[Gmail]/Lists/*"     . ?l)
          (:maildir "/keithbutler2001@gmail.com/[Gmail]/Sent Mail"   . ?s)
          (:maildir "/keithbutler2001@gmail.com/[Gmail]/Trash"       . ?t)))

  ;; (add-to-list 'mu4e-bookmarks
  ;;              (make-mu4e-bookmark
  ;;               :name "All Inboxes"
  ;;               :query "maildir:/keithbutler2001@gmail.com/[Gmail]/INBOX OR maildir:/keith@keithbutler.xyz/INBOX OR maildir:/20089137@mail.wit.ie/[Gmail]/INBOX"
  ;;               :key ?i))

  ;; don't keep message buffers around
  (setq message-kill-buffer-on-exit t)

  ;; Start mu4e in the background so that it syncs mail periodically
  (mu4e t))
#+end_src

** ERC
#+begin_src  emacs-lisp :results none
(setq erc-prompt (lambda () (concat "[" (buffer-name)"]"))
      erc-server "irc.libera.chat"
      erc-autojoin-channels-alist '(("irc.libera.chat" "#emacs" "#linux"))
      erc-nick "Quayth"
      ;; erc-user-full-name "Keith Butler"
      erc-auto-query 'bury
      erc-fill-column 100
      erc-fill-function 'erc-fill-static
      erc-fill-static-center 20)
#+end_src

** Vterm
#+begin_src  emacs-lisp :results none :tangle packages.el
;; (package! )
#+end_src

#+begin_src  emacs-lisp :results none
(require 'vterm-module)
(setq vterm-shell "/bin/fish")          ;; default shell
(setq vterm-always-compile-module t)    ;; skip asking to compile
(setq vterm-max-scrollback 100000)
(setq vterm-kill-buffer-on-exit t)
#+end_src
