home/features/emacs/doom/config.el

(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
    ;; :hook (after-init . org-roam-ui-mode)
    :custom
    (org-roam-directory "~/workspace/org/roam/")
    (org-roam-dailies-capture-templates
      '(("d" "default" entry "* %<%I:%M %p>: %?"
         :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

(after! org
  (setq org-clock-sound "~/.doom.d/ding.mp3"))

(add-hook! org-mode :append #'org-appear-mode)

(setq org-publish-use-timestamps-flag nil)
(setq org-export-with-broken-links t)
(setq org-publish-project-alist
      '(("keithbutler.xyz"
         :base-drectory "~/workspace/org/keithbutler.xyz/"
         :base-extension "org"
         :publishing-directory "~/workspace/org/keithbutler.xyz/html/"
         :recursive t
         :exclude "org-html-themes/.*"
         :publishing-function org-html-publish-to-html
         :headline-levels 4
         :auto-preamble t)))

(use-package org-auto-tangle
  :load-path "site-lisp/org-auto-tangle/"    ;; this line is necessary only if you cloned the repo in your site-lisp directory
  :defer t
  :hook (org-mode . org-auto-tangle-mode))

(when (require 'openwith nil 'noerror)
    (setq openwith-associations
        (list
            (list (openwith-make-extension-regexp
                '("mpg" "mpeg" "mp3" "mp4"
                    "avi" "wmv" "wav" "mov" "flv"
                    "ogm" "ogg" "mkv"))
                "vlc"
                '(file))
            (list (openwith-make-extension-regexp
                '("xbm" "pbm" "pgm" "ppm" "pnm"
                    "png" "gif" "bmp" "tif" "jpeg" "jpg"))
                "feh"
                '(file))
            (list (openwith-make-extension-regexp
                '("doc" "xls" "ppt" "odt" "ods" "odg" "odp"))
                "libreoffice"
                '(file))
            '("\\.lyx" "lyx" (file))
            '("\\.chm" "kchmviewer" (file))
            (list (openwith-make-extension-regexp
                '("ps" "ps.gz" "dvi"))
                "okular"
                '(file))
            ))
    (openwith-mode 1))

;; active Babel languages
(org-babel-do-load-languages
 'org-babel-load-languages
 '((mermaid . t)
   (scheme . t)
   (emacs-lisp . t)
   (python . t)
   (Kotlin . t)
   (bash . t)
   (sql . t)
   (rust . t)
   (plantuml. t)
   ))

(add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
(org-babel-do-load-languages 'org-babel-load-languages '((plantuml . t)))

(setq erc-prompt (lambda () (concat "[" (buffer-name)"]"))
      erc-server "irc.libera.chat"
      erc-autojoin-channels-alist '(("irc.libera.chat" "#emacs" "#linux"))
      erc-nick "Quayth"
      ;; erc-user-full-name "Keith Butler"
      erc-auto-query 'bury
      erc-fill-column 100
      erc-fill-function 'erc-fill-static
      erc-fill-static-center 20)

(require 'vterm-module)
(setq vterm-shell "/bin/fish")          ;; default shell
(setq vterm-always-compile-module t)    ;; skip asking to compile
(setq vterm-max-scrollback 100000)
(setq vterm-kill-buffer-on-exit t)
